{
  "users": [
    {
      "email": "mukub@mailinator.com",
      "password": "$2a$10$D7rAwNZ1vHy21hVUKoa2A.qq1H6o2kVG38st2MAuYDegAkH4Rv7ei",
      "name": "Glenna Mendez",
      "id": 1
    },
    {
      "email": "admin@admin.com",
      "password": "$2a$10$KcIy1wQyasyLqSY/VZsrfewmMKTVPz2J3qIcH7reLu6Ix.j0DGiwC",
      "name": "admin",
      "id": 2
    },
    {
      "email": "ilove@ears.com",
      "password": "$2a$10$8R3nvpO4dQx70b57LzeHJuaBVJTq8efVRuFGnFI17nZgxmUEexKOi",
      "name": "Mike Tyson",
      "id": 3
    },
    {
      "email": "bomyn@mailinator.com",
      "password": "$2a$10$nMGNVJBs35tqX/7woQVNburft5Lgenyh6BChRZWCaNgGTmH63pEmG",
      "name": "Kato Holcomb",
      "id": 4
    },
    {
      "email": "kydojebybe@mailinator.com",
      "password": "$2a$10$TuXTypkim/1asgFmMLQaXOcjNsqR9o.Ub7p/tJSNKm8PEVGfz/rCC",
      "name": "Winifred Alford",
      "id": 5
    },
    {
      "email": "typytygome@mailinator.com",
      "password": "$2a$10$sNUXHQMibIO2ybmqMCtqpOxlysUTl8HURsoLEqjftRkeqDz68thJy",
      "name": "Chastity Marks",
      "id": 6
    },
    {
      "email": "gefijyla@mailinator.com",
      "password": "$2a$10$6.e/8kMeAfUQPxvilGvMoeB7S1XS6QPYib6YctjnrkN.7jC8bokh.",
      "name": "Hamilton Keller",
      "id": 7
    },
    {
      "email": "jome@mailinator.com",
      "password": "$2a$10$xYXS9dCcd8TIQT63N.RSre/FLnp19PYdRc2YvUiCDf16JEKaxWdOq",
      "name": "Mason Barry",
      "id": 8
    },
    {
      "email": "qizit@mailinator.com",
      "password": "$2a$10$vdUEUBIYvjz.K8DlWk/PhOZctf7txv8V.Ud/TvcNXjLJRtQMvEPc6",
      "name": "Lilah Herring",
      "id": 9
    }
  ],
  "movies-popular": [
    {
      "id": 1,
      "title": "Inception",
      "genre": "Sci-Fi",
      "year": 2010,
      "image": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_.jpg",
      "description":"Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction: stealing valuable secrets from deep within the subconscious during the dream state. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage but has also made him an international fugitive and cost him everything he has ever loved. He is offered a chance at redemption when he is given a seemingly impossible task: plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move."
    },
    {
      "id": 2,
      "title": "The Shawshank Redemption",
      "genre": "Drama",
      "year": 1994,
      "image": "https://www.originalfilmart.co.uk/cdn/shop/products/shawshank_redemption_R04_original_film_art_d6143a10-40d8-483f-be6f-76a715c3d84d_5000x.jpg?v=1644085657",
      "description":"Andy Dufresne, a successful banker, is wrongly imprisoned for the murder of his wife and her lover. Despite his claims of innocence, he is sentenced to life at Shawshank State Penitentiary. Over the next two decades, Andy befriends fellow inmate Ellis 'Red' Redding and becomes instrumental in a money-laundering operation led by the prison warden. His unbroken spirit and quiet acts of rebellion lead to a surprising and liberating end for both Andy and the prisoners around him."
    },
    {
      "id": 3,
      "title": "The Godfather",
      "genre": "Crime",
      "year": 1972,
      "image": "https://www.vintagemovieposters.co.uk/wp-content/uploads/2023/08/IMG_4675-scaled.jpeg",
      "description":": The Godfather follows the powerful Italian-American crime family of Don Vito Corleone. When the don's youngest son, Michael, reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal. Despite his initial desire to distance himself from the family business, Michael soon finds himself taking control of the empire and transforming into the ruthless and cunning leader his father had hoped to avoid."
    },
    {
      "id": 4,
      "title": "Pulp Fiction",
      "genre": "Crime",
      "year": 1994,
      "image": "https://static.posters.cz/image/750/poster/pulp-fiction-cover-i1288.jpg",
      "description":"Quentin Tarantino's Pulp Fiction is a rich tapestry of interwoven stories revolving around two hitmen, a boxer, a gangster and his wife, and a pair of diner bandits. The film's non-linear narrative style and sharp dialogue redefine storytelling, as it delves into themes of violence, redemption, and the quirks of fate in the criminal underworld of Los Angeles."
    },
    {
      "id": 5,
      "title": "The Dark Knight",
      "genre": "Action",
      "year": 2008,
      "image": "https://i.ebayimg.com/images/g/DgsAAOSw4qZdnKft/s-l1200.jpg",
      "description":"In the gripping sequel to Batman Begins, Bruce Wayne's alter ego, Batman, faces his greatest psychological and physical tests when the chaotic and anarchic Joker emerges from the shadows. With the help of allies Lt. Jim Gordon and DA Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague Gotham City. However, the Joker's deadly game threatens to unravel Batman's resolve and challenge his moral limits."
    },
    {
      "id": 6,
      "title": "Fight Club",
      "genre": "Drama",
      "year": 1999,
      "image": "https://m.media-amazon.com/images/I/61IgtYrLF5L._AC_UF1000,1000_QL80_.jpg",
      "description":"An unnamed narrator, disillusioned with his white-collar job, forms an underground fight club with soap salesman Tyler Durden. The club becomes a form of male bonding that spirals into something much darker. As the fight club's popularity grows, it evolves into an anarchistic and violent anti-consumerist organization, leading the narrator to confront the disturbing truths about himself and the nature of his reality."
    },
    {
      "id": 7,
      "title": "Forrest Gump",
      "genre": "Drama",
      "year": 1994,
      "image": "https://media.posterlounge.com/img/products/710000/705934/705934_poster.jpg",
      "description":"Forrest Gump, a man with a low IQ, has never thought of himself as disadvantaged, and through a series of unexpected events, he proves that determination, love, and the kindness of strangers can have a profound impact on a person's life. From running across the country to inspiring an entire nation, Forrest's journey takes him through pivotal moments in American history, all while he longs for his childhood love, Jenny."
    },
    {
      "id": 8,
      "title": "The Matrix",
      "genre": "Action",
      "year": 1999,
      "image": "https://i.ebayimg.com/images/g/EzkAAOSweJZiLfwM/s-l1200.jpg",
      "description":"Computer hacker Thomas Anderson, aka Neo, discovers that reality as he knows it is a simulated construct controlled by malevolent cyber-intelligence. With the help of legendary hacker Morpheus and the enigmatic Trinity, Neo awakens to the real world, where he joins the fight to free humanity from the Matrix's control. As Neo learns to harness his newfound abilities, he faces off against relentless agents determined to suppress the human rebellion."
    },
    {
      "id": 9,
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "genre": "Fantasy",
      "year": 2001,
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSZWAvHEL0quGtctenRfikrDOLojq0q7KKfLQ&s",
      "description":"In the tranquil Shire, young hobbit Frodo Baggins inherits a simple gold ring. Unbeknownst to him, the ring holds immense power and is sought by the Dark Lord Sauron. To protect Middle-earth, Frodo, along with a diverse group of companions known as the Fellowship, embarks on a perilous journey to destroy the ring in the fires of Mount Doom, where it was forged."
    },
    {
      "id": 10,
      "title": "The Lord of the Rings: The Two Towers",
      "genre": "Fantasy",
      "year": 2002,
      "image": "https://shotonwhat.com/images/0167261.jpg",
      "description":"The Fellowship is broken, but the quest to destroy the One Ring continues. Frodo and Sam, guided by the creature Gollum, edge closer to Mordor. Meanwhile, the divided members of the Fellowship face dangerous new alliances and battles, most notably the epic clash at Helm's Deep, as the forces of Sauron press their assault on Middle-earth."
    },
    {
      "id": 11,
      "title": "The Lord of the Rings: The Return of the King",
      "genre": "Fantasy",
      "year": 2003,
      "image": "https://m.media-amazon.com/images/I/71fl6umyGrL._AC_UF1000,1000_QL80_.jpg",
      "description":"The final confrontation between the forces of good and evil fighting for control of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith. The fate of Middle-earth hangs in the balance."
    },
    {
      "id": 12,
      "title": "Inglourious Basterds",
      "genre": "War",
      "year": 2009,
      "image": "https://m.media-amazon.com/images/M/MV5BOTJiNDEzOWYtMTVjOC00ZjlmLWE0NGMtZmE1OWVmZDQ2OWJhXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
      "description":"During World War II, a group of Jewish-American soldiers known as 'The Basterds' are chosen to spread fear throughout the Third Reich by brutally killing Nazis. Their mission coincides with the plans of a young Jewish cinema owner, who seeks revenge for her family's execution by the Nazis. Their paths cross at a movie theater where a high-profile Nazi premiere is set to take place, leading to an explosive and unpredictable climax."
    },
    {
      "id": 13,
      "title": "The Silence of the Lambs",
      "genre": "Thriller",
      "year": 1991,
      "image": "https://m.media-amazon.com/images/M/MV5BNjNhZTk0ZmEtNjJhMi00YzFlLWE1MmEtYzM1M2ZmMGMwMTU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
      "description":"FBI trainee Clarice Starling is assigned to interview Dr. Hannibal Lecter, a brilliant psychiatrist and incarcerated cannibalistic serial killer, to gain insights on capturing another serial killer, Buffalo Bill. As Lecter plays a psychological game with Clarice, the stakes escalate, and she must confront her own dark past while racing to stop the killer before he claims another victim."
    },
    {
      "id": 14,
      "title": "Goodfellas",
      "genre": "Crime",
      "year": 1990,
      "image": "https://i.ebayimg.com/images/g/4Y8AAOSwqu9VHq9N/s-l1600.jpg",
      "description":"Based on the true story of Henry Hill, a half-Irish, half-Sicilian New York kid who grows up idolizing the gangsters in his neighborhood. Henry works his way up the ranks of the mob, enjoying a lavish lifestyle until his involvement in drug trafficking unravels everything. As the law closes in, Henry's life descends into paranoia and violence, ultimately leading to his downfall."
    },
    {
      "id": 15,
      "title": "The Departed",
      "genre": "Crime",
      "year": 2006,
      "image": "https://is1-ssl.mzstatic.com/image/thumb/Music/92/1b/05/mzi.jifetyuy.jpg/1200x1200bf-60.jpg",
      "description":"In Boston, an undercover cop and a mole in the police force are each trying to identify each other while infiltrating an Irish gang led by the ruthless Frank Costello. Billy Costigan, the undercover cop, struggles to maintain his cover while Colin Sullivan, the mole, manipulates law enforcement from within. As the tension escalates, their paths inevitably cross, leading to a deadly confrontation."
    },
    {
      "id": 16,
      "title": "The Green Mile",
      "genre": "Drama",
      "year": 1999,
      "image": "https://m.media-amazon.com/images/M/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_FMjpg_UX1000_.jpg",
      "description":"Paul Edgecomb, a death row corrections officer, encounters John Coffey, a massive black man convicted of raping and murdering two young girls. Despite his imposing appearance, Coffey possesses a gentle nature and miraculous healing abilities. As Edgecomb and his colleagues witness Coffey's extraordinary powers, they begin to question his guilt and the true nature of his gift, leading to profound moral and emotional conflicts."
    },
    {
      "id": 17,
      "title": "Gladiator",
      "genre": "Action",
      "year": 2000,
      "image": "https://m.media-amazon.com/images/I/71TTECGgpuL._AC_UF894,1000_QL80_.jpg",
      "description":"Roman general Maximus Decimus Meridius is betrayed and his family murdered by the corrupt son of the emperor, Commodus. Reduced to slavery, Maximus becomes a gladiator and rises through the ranks of the arena, driven by his desire for vengeance. His prowess in combat and his quest for justice earn him the support of the Roman people, leading to a climactic showdown with Commodus."
    },
    {
      "id": 18,
      "title": "The Prestige",
      "genre": "Drama",
      "year": 2006,
      "image": "https://images.genius.com/6bf8e9c78d07719f02a20214c4864614.667x1000x1.jpg",
      "description":"Rival magicians Robert Angier and Alfred Borden engage in a bitter competition to create the ultimate stage illusion. As their rivalry turns increasingly dangerous and deadly, their obsession with outdoing each other leads to tragic consequences. The film explores themes of sacrifice, deception, and the blurred lines between reality and illusion."
    },
    {
      "id": 19,
      "title": "The Lion King",
      "genre": "Animation",
      "year": 1994,
      "image": "https://miro.medium.com/v2/resize:fit:1000/1*ibiKVRfLzrsFAdye8Mj4WQ.jpeg",
      "description":"Young lion cub Simba is destined to follow in his father Mufasa's footsteps as king of the Pride Lands. However, Simba's treacherous uncle Scar schemes to usurp the throne, leading to Mufasa's death and Simba's exile. With the help of his friends Timon and Pumbaa, Simba grows up in the jungle and eventually confronts his past, returning to reclaim his rightful place as king."
    },
    {
      "id": 20,
      "title": "Titanic",
      "genre": "Romance",
      "year": 1997,
      "image": "https://m.media-amazon.com/images/I/81n3QXOwA1L._AC_UF1000,1000_QL80_.jpg",
      "description":"Jack Dawson, a young artist, wins a ticket aboard the RMS Titanic, the world's most luxurious ship. He meets Rose DeWitt Bukater, a young woman trapped in a suffocating engagement to a wealthy but controlling man. As Jack and Rose fall in love, they must navigate their differences and the impending tragedy as the Titanic strikes an iceberg and begins to sink, leading to a heartbreaking conclusion."
    }
  ],
  "favorites": [
    {
      "userId": 1,
      "movieId": 2,
      "id": 1
    },
    {
      "userId": 1,
      "movieId": 4,
      "id": 2
    },
    {
      "userId": 1,
      "movieId": 8,
      "id": 3
    },
    {
      "userId": 1,
      "movieId": 7,
      "id": 4
    },
    {
      "userId": 1,
      "movieId": 8,
      "id": 5
    },
    {
      "userId": 1,
      "movieId": 7,
      "id": 6
    },
    {
      "userId": 1,
      "movieId": 11,
      "id": 7
    },
    {
      "userId": 1,
      "movieId": 11,
      "id": 8
    },
    {
      "userId": 1,
      "movieId": 16,
      "id": 9
    },
    {
      "userId": 1,
      "movieId": 3,
      "id": 10
    },
    {
      "userId": 1,
      "movieId": 4,
      "id": 11
    },
    {
      "userId": 1,
      "movieId": 4,
      "id": 12
    },
    {
      "userId": 1,
      "movieId": 4,
      "id": 13
    },
    {
      "userId": 1,
      "movieId": 3,
      "id": 14
    },
    {
      "userId": 2,
      "movieId": 1,
      "id": 15
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 16
    },
    {
      "userId": 2,
      "movieId": 3,
      "id": 17
    },
    {
      "userId": 2,
      "movieId": 3,
      "id": 18
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 19
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 20
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 21
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 22
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 23
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 24
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 25
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 26
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 27
    },
    {
      "userId": 2,
      "movieId": 1,
      "id": 28
    },
    {
      "userId": 2,
      "movieId": 1,
      "id": 29
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 30
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 31
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 32
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 33
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 34
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 35
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 36
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 37
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 38
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 39
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 40
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 41
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 42
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 43
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 44
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 45
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 46
    },
    {
      "userId": 9,
      "movieId": 17,
      "id": 47
    },
    {
      "userId": 9,
      "movieId": 1,
      "id": 48
    },
    {
      "userId": 9,
      "movieId": 3,
      "id": 49
    },
    {
      "userId": 9,
      "movieId": 8,
      "id": 50
    },
    {
      "userId": 9,
      "movieId": 12,
      "id": 51
    },
    {
      "userId": 2,
      "movieId": 2,
      "id": 52
    },
    {
      "userId": 2,
      "movieId": 6,
      "id": 53
    },
    {
      "userId": 2,
      "movieId": 12,
      "id": 54
    }
  ]
}
